Repository: VinRu5/twelve_notes
Catalog: lib/l10n/app_*.arb
Languages: it

# titleLogin
source: Ready to play!!!🎸
it: Pronto per suonare!!!🎸

# ctaLogin
source: Login
it: Accedi

# signUpText
source: You haven't signed up yet?
it: Non sei ancora registrato?

# signUpCta
source: SignUp!!!🚀
it: Registrati!!!🚀

# emailConfirmLabel
source: Confirm email
it: Conferma email

# passwordConfirmLabel
source: Confirm password
it: Conferma password

# nameLabel
source: Name
it: Nome

# surnameLabel
source: Surname
it: Cognome

source: or
it: o

# resetPswMessage
source: You cannot to access?
it: Non riesci ad accedere?

# resetPswCta
source: Reset password🔄
it: Resetta la password🔄

# welcomeMessage1
source: Play the music you love.
it: Suona la musica che ami.

# welcomeMessage2
source: Wherever you are.
it: Ovunque tu sia.

# welcomeMessage3
source: Share it with whomever you want.
it: Convidila con chi vuoi.

# welcomeMessage4
source: Have fun.
it: Divertiti.

# welcomeCta
source: Start now
it: Inizia subito

# closeCta
source: Close
it: Chiudi

# loginGenericError
source: An error has occurred. Please try logging in again.
it: Si è verificato un errore. Riprova ad effettuare l'accesso.

# loginWrongCredentials
source: The credentials don't seem to be correct. Please try again.
it: Le credenziali non sembrano corrette. Riprova.

# loginAccountNotExsist
source: The account you're trying to log in with does not exist. Please register before.
it: L'account con cui stai provando ad accedere non esiste. Effettua la registrazione prima.

# titleRegister
source: SignUp!!!
it: Registrati!!!

# registerErrorEmailMatch
source: The email and confirm email fields must match.
it: Il campo email e conferma email devono coincidere

# registerErrorPasswordMatch
source: The password and confirm password fields must match.
it: Il campo password e conferma password devono coincidere

# ctaSignUp
source: Sign Up
it: Registrati

# resetPswModalMessage
source: We will send a message to the following email address:
it: Ti invieremo un messaggio al seguente indirizzo email:

# resetPswModalCta
source: Send email
it: Invia email

# errorWrongPassword
source: The password must contain: 1 uppercase letter, 1 lowercase letter, 1 symbol, 1 number, and be at least 8 characters long.
it: La password deve contenere: 1 lettera maiuscola, 1 lettera minuscola, 1 simbolo, 1 numero e lunga almeno 8 caratteri

# errorAlreadyExsist
source: This email is already registered. Please try another one.
it: Questa email risulta già registrata. Prova con un'altra.

# errorGeneric
source: An error has occurred. Please try again.
it: Si è verificato un errore. Riprova.
